#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "9dfa898706165e06fee5786a51040cb4" -> "1fa51d40bc5cbcf72c5f4de4325143c9"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "f7d4edc078bda15294565d6cfdbb4737" -> "c2a167513b6c14fc5f531d23a9d4f3b4"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "970b7c4bf1defaa1f499971e2f7dadc3" -> "e641e24a6cf4ad66a5bff427b36d35b3"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3fa3575a0f5112e5c8c40afd55a758b0" -> "5d76e879067f553fc0666854c6ae284e"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "0d464f3283f262cbf398ef393004c540" -> "a0d5f0dd98b8a6edddd3f54cd99f09e3"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "016542daaf80f0c180aa8f18538d3dfc" -> "bf85dffcd43da928f7a80eca3493d03e"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "c6259c5a67c3cf8fb3ac4bedf5ccd3b6" -> "d99c9948b849849a77ffa144910f4518"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "46680c67f504af0c44590134fa7ab838" -> "2f76c4e7589c524c04802beac479e5f4"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "73b6dc0f9e328b1816fa39283cff23ad" -> "43db2c8ca9a644b790fb42a95ff69dfc"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "17fadbf5bf91ace5143a5bff090faa0b" -> "3f17c82b7352a8aea1165fe6f503b98c"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "fc0e5fcadb4245c70c1bd5b2aa565be6" -> "17dba3f9b7a40a879c17fc73ff3ea796"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "cf54d329a8f017242dc7a520d6e36bc7" -> "104450d8ab82b2540ab380b83ecadac0"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "85f36bc683aed55811b365952aaff534" -> "27fffcc78ee142c3c867d794fd9799d8"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "4e856f4d1b73d6a2d45357bffae91d5a" -> "72785bd5d3fa19069a26e5c03265688c"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "2a0240eaea5433be9626abd29dcca298" -> "110b854dae48d5129c08affc421b377e"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "c2226ca979dca0e1937d757a23368892" -> "366220081111f53b1b499b5bc6c2e07a"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "b3b756f720dc6616e83d10ce3c3b23a6" -> "3c86e86eea9d50430f2c1c2961a2b220"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "e88e48fbf7e3454e6ba1b752b7200074" -> "5f88b344dd5c6681a5f82bf4d30fec7f"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "15d804038a669bbedba23babc581ca02" -> "17f046eb057a21f5feac06da32674cf0"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "a951b2420b06664046f510d417b58cf1" -> "fd0389a76e2c9f61d62ff130a0794306"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "4ae13af65e628ac94e0a4a61409a27d0" -> "26abf2dc7b1ae7ff9d5da81265ea1a94"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "4b710a6eb51ffb8a3cbdcf1a00d8bd6d" -> "910d8e9fbf62d36eb5c4d2300c22ffa0"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "38eb2b445c60b083aae5bc5b013eebe7" -> "436972ef31358210f2579d2e2efc3d2a"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "1dfb7ebc0fcaaad1afa567aaef27b5eb" -> "057aa1c9b7e720194c2aae6a50306be4"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "289c3dd493563906c7488b5fdc5c0604" -> "ec2f0e5e0beeaed984b6c956ee352b35"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "cb3fee2cc35e48109801f753484ff7ac" -> "266b3e6aed9757caf84df488c6a73ed9"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "e38f25ef87b26bb1c8177263d0a36c2f" -> "ed53db97902441df01ea2490f8f5bba9"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "abbc5edf82350fb0547c107088d026c9" -> "1c63c1a027c22329484095f779143712"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "c6467d705ac18c70bab6f2ab56032e78" -> "dacbb0c0cd4ba1f6bc8c43324831ba81"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "1b084492e1b80e145b9ea3392fc6c8ab" -> "094a9d2e66be54453ab301f2c5853461"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "62d7077847632fb1ffdaedccafd5961c" -> "566ff64455c002fb85f8d90642d47a9a"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "53fd74a9e5ad9dc42689d9662223183b" -> "2b2870ec3cc21f89277cb37b2e2b107d"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "c0eb681921fb2e54d75154546bb7a128" -> "863b9a9d72ce80ef92fc140750f76603"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "b1c641e4df619b5937437173fcc85642" -> "c1e4d878c08a6be4caffef48b553d20f"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "3a0a082f04922f129fa7cea523f8f1da" -> "911a86f1ba08ccb381ec3b4d389dccb4"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "db024e45b13fc4edd5998723f8c07434" -> "f418c7fcf92614fe50d136a66f2451c8"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "769882068a1d2207aa75ad4d4b090054" -> "4603e8c584a46c53ad8efec5488f5556"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "d3645613e032a32a24478e03c698c453" -> "be7f6df6f4fa7619e970c0104afa1d97"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "cfdf65af28517a3028b411b05c3945c8" -> "a68c5506d1d1ed1b88c23cfd1ef7c1ce"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "570ebd803319745416a5ec1c2e3b3d1e" -> "923fb3926d32593a8a1f0a3fed31e53f"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "9bd92fbf2e3c88037ae4d40d95ae30da" -> "26644f7577738f9dc189b95ab8324aad"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "4894514ec3154ab067ac95c5109879b3" -> "834de2afd81cad703c9cdd2c8195ed9f"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "2a9498fc952184fe7fe5f33f28d79297" -> "b719a45aa7b4bcce02ca3279f094cfba"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "73d080922ea50a7347c063a932894f7c" -> "b216df71dc2afbe8284df7743a083f66"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "81b0157ed85d1c597d65afe145175ac9" -> "140e74118f1ec602e0a9ab6a14b16e96"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "71d3e0a7ccf4fb1585ad81053fa793f6" -> "c0d312c1bee34ac03074f5eaa2e9167f"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "55f28fa4dd4a73b65b546d9198b4f5cd" -> "585d4777f1e2434d7e5fb2857330bc17"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "vr7QrhnFA8t9frYLxEk3+sgOQwgxvoCJ3v/xZQWqajw=" -> "PkqRp1rRc2XVokz9YnkRNQD/gJ28LBMH/DFHxwo4lX8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "OfKiET7fSTptKruCAi3eIfVpvo1AaKOssyfXwb41WnE=" -> "j+BjUE3e5OVOlRleBHiH8IX55G4jXqZ9R2iOVx36OQg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S4ee+qHw8+SM/BDZJU1boiGllIG2EPOskqAXyHr++fY=" -> "LqfCwIfpCQM1/hzuHum3eSD/rf8QHS2/0Ssly2DChVA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "CaVX2Xf6WjmmlEWACLVBKDPapUE/RuV8fOZEYq/auKs=" -> "qfm++fW4Fu2PVW6WX4QZrNwKgpW0UulVWiFlQZIPEf0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "NOwxYsyEDmsLGOpTAnLftN7FC97RVb/Th1diQHwwXlc=" -> "ej3Lg/0Nj5EVvnTLQM5CbuFeq4yBcx+mROgGl2OhCkw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "WZuN1QLX5A0bMwgp1PnP6FGDTvoVzD9der+Zvflc6o4=" -> "NovNOAtOVpRu45HdyZf8zkB8e0mzwG8fXBitA2u5FVo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "CcIxqTF7qPtWfTkShvjh7XkvjPxPC5g9gI69l+/O3WA=" -> "3Ly7MyS4WFxIoLCJ6b470GAwZT1KsZv/Hj5uyDJT7jk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "QFwEsl5V9rTSbBXtOq9/3GetewBME9ft5t6ndqMJOq0=" -> "X+6yJp2ROyZGJPGO7+wVcjotseGmHJ/HP41d1i+wUiU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "GmGWM8ttJWYL2bxlEkkqKIPE9jG+7PwW+i2nAgSIIxs=" -> "dx57dNnx/2rb84XO6To6rQ0D18KK2GZT54OjzN4kkMs="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BpmH+dwHEYjKrUWMr8krlWtFN05z2qxW5bzqN/b7M2I=" -> "bhS3VkL3TPBOkRtovAyjpJskJGrrxsWDWZC1EPbOpB4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "iYC48jujmYvuimJJ5OnhtKKgTMYySsYGnn1D/MZNUCs=" -> "LCAbONLnd58o/YKzsBwAi9GzBxUdSJ2/bSJLgpuEevo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "jF7kV8VgN0fvl7DhjsNUF435u3gqVHKxmozUU0KQQ5c=" -> "bq7OuQ16w+nq71HbWtw5gH6pJfOmBGgBmMx9UKYFRYU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "V/fGpvPr7mk7kXto08QfyMgLyVNu0l/iE1Ohy3aEpGg=" -> "AwJmAMTuxqFLOkKdTWyknh04H+JlqW1gtC38QtguhHM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "9V9ulfqtQpRnv04XCDI4td/RQcpY1WiWmvu1GLaYUIc=" -> "fhcNrN5gNEbC2BfYLZbkzLUEztVu5pWdr8y1IZo/0Fk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "kAD5QQO1vw881BKmJijTBg1uGb2YwLj3Kgy79NfFP0c=" -> "aDKa9pookZekFb/KBCQCrMcIhBU402ajNrBKiSQjw8k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "hpx8rPd/R1upgj1Evlu8ROO4g6c2F812XhPm2wixlfo=" -> "F2O5yGQJLTouazkNKii4s/q9FAt0ZKgM3dnS4MWyq6w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZdKjnfBpu1thx2oCBi8ofW+0mYW6l/gT7sLSjvPHOZE=" -> "xEIRWasBiP/v2JBOzbt+1X4wQIVFrQ1IfiZOMXAlUb0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "UojKfN8YCvdfMvdiJCfX+mMHqoVxaYrSgNDjKgo6WGo=" -> "r5OGgje8YY0bPBnG9PEZ+DpRCDLlYo41s/PZzq4bS30="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "BCg9tUn+7iiyfaLqwLbWgXqc5lHcmEAOfhrEgWHLfTM=" -> "riZfyWygQ0hcf574wzLeMhzE5NuSy0/pqVz458nPEZ8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "PntiIDQmYUeA0iaGrl5Bo42F9b/zKz0Jo+vIVl/uqyk=" -> "hDBv2beMPzPpRPPFj9OCVDcogOkQKI7iR7GQGZ3ryWY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "cgTg9aqLS/7ad8gEhvyMMSwo+JQa2b6RQdU8ub+Luq4=" -> "uolwSahAEyzVq4vLpYhMSTodKdVDop4n56DMoEdXpY4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8H/BiddRAkkdXQ+O0EgjpGwJJB2ouRkwvmgAC672u8=" -> "gfdtVxSjJoa1F2keFNZ46pxiLjmeNydnByeTgWuneTI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "imTynxs4TwjJsaS6tkqyqiU6Bkx5cs02QIQiNvc9Uh8=" -> "QF8Q6GdNDZz13UvGMO1urxMSa11B6UjB2XlOCyrZdLI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "c+Vr/Vh1jJUTSOACQmqGwjm7rdxHY0GbW2yrLAMj814=" -> "+CBJXjW8Lc9NjFoL/0wKHABFqQoaa/DR3sTukok67zY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ux6YyJEo9q7PNdQDXHiwgb0rrRmk+iNWrWTj074hGZ0=" -> "6fBWJi3Yh+W47CUfT3xQ5qEE9Ba//TdZVBiWluPomr8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "dpPlC/ilBFFhxOYXwvzRWfdsBqpybWocnow+rsCBNTI=" -> "zJxh9ijGChFkefmp1At0RQqj+mq/NX+IpG0K1wgo4x4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "OiTFYPO+aubAY7r1KgGicMg96e2voqNaTbMpvc2WnIY=" -> "hyRxdd8EG2Pc2ZMc6dc9jowQEi/I5LqPx5l/0WwfI60="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "WP7dnjKJfipoQ7Qwd/WMeDoAqKcY9amt8EzIo0Rgm9o=" -> "bnrS/5vyTVJwKr5cx4N9AJ62Cg4pnIi4AyUtl5NW0tQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "q7UfKocfLxSdFJpx78BH2puJxxlcdJqVMTPR2vQe9vA=" -> "ktoIBi0YIoC9WSWETw83ST4qSPtWO/L5qTmsTKNpnV0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpS1U9Z5EWsbvJ22Gebp2q5d+Rha5ROifSBpRzDe2z4=" -> "dfYO3K5uwLxxK8aTFwzEn0uL3WO8b27iUXcvJtffVyg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-03-01T17:28:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "6VLMwkWxi1npZ2eAFj+SbC1KERC4px2AZ0+G+qOff0c=" -> "E7cSBwoVD3JYK3P9GaknsaCwH2uttEQcBlrwSLSis68="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvcVYR9coVEp9/xdxoNbyPwyKM2Hv2trjKWymEY9QCw=" -> "0uwNkhpQa3W7qnvf8wDB9/3pOKSLGh8MTEQqwPVtnFQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "zP9mWIr1qBfsIWU5+X1QavzeBr6JgkxNBFssZsnDwXQ=" -> "U8Ii3gYui80K3iSaiD+R7w/VHlA+2Tz/geRHIEoQFzc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "DPl2jPVb+cRwssZ7zZuWbKSwqkVfXOPjwb6UGEcYAhQ=" -> "F+QGkD8AiQOuZRjR8ZMU8/Eoo5t23rTPIncxTYSfCxs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "S2Q5x/riPAAexMLNJEwtllgImcWdZboGh05VwKodwHc=" -> "JD/7Aef/mWndlZ/WPdjsQdqg0KZeyiBiJisF24CUKcU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "JqbHgTvnMAwRBy0/M1NSE3Ni60EH4PCwBfjdHYXVBt4=" -> "3Xf09jIak8536Ru4mlXd5ylnYWmC/r/cYGTykdwTYfc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "/yJShIEG7ngEWc5BPmKSkJkbaqR56B5MIGAUu+Ga8xM=" -> "hAbptRqYL3EQXYyhxMQXPPVGJWut11FKTgiqlvqg+fY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "m3D9KozMG7tlqi29QgIIDP6LUfzPzb74ic/9yGZRTao=" -> "YARDcSuRp0vMoq5yFtTm+Yk3hJJ1ag8smZs6FBwkg1o="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "8W2r67VfWc58ROol2GoZ5Ohg5weHdqEE86MZjH41jjk=" -> "2PxTqcNc3LdrrU9z6p+wrkYW3jFifonCEXMWkgacoI0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Z6iXU2Xl7Jswk5KptoRuoNFraddADHzEIZz7lqLyX40=" -> "8gj3SH/vfsZuZapI0NcFS8iOUvjhyiDRjysbjm1ZCZs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "xaVn/8EHWkR3pt5t+6o27iEAmuXMWuv9mg4T6OEQtb8=" -> "NVdyjdSCWhoEt0p4BSBjI+mVrC2zJSScH5AaE34WYNc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Kz3ylBq8c14k13cr2WZQDH47cHOlLGl0NUOVF01ifw0=" -> "8rNFCvJn2mD6sHFANKHJ1ivWmYTT5GN1otmpvySNY3Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "qCP3o5noUURd1OoLCNRC1skcQ7MWc6mcS8Sq6ygCJbI=" -> "qSmp/5ATM+11f31ui+fXy+EvHsV9JDCRHxSyrZw55Ig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "gJVPbubwmLTDEAz6O6o9/kmPIV9vNahTEHmweTquh6U=" -> "xn/6G4gYFejFaVz0hdfVchX54as/LDjwUFfIxKRNpPg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-03-01T03:35:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "02A+jeS74O2i83wYRA4JPKJqWtILDJK5CIrIIG/CzUs=" -> "ZTHK2hYU1u4JH5XzluApWkmSPfuZ+ezP3hXKA48hfWc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-03-01T03:34:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "L3NIq7fOjadd0meOAQCM/S3Q4hEUci656YK/pYNGdeI=" -> "UTAklTSWEi2RmzSA5JUo2Z3hsGH+Ysdle0jLZnSsaas="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-03-01T03:34:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "vzsy71" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-03-01T03:34:19Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-03-01T03:34:18Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*